app/Controllers/DashboardController.php

    public function index()
    {
        $obatModel = new ObatModel();
        $pemasokModel = new PemasokModel();
        $pelangganModel = new PelangganModel();
//
        $data = [
            'totalObat' => $obatModel->countAllResults(),
            'totalPemasok' => $pemasokModel->countAllResults(),
            'totalPelanggan' => $pelangganModel->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `obat`
SELECT COUNT(*) AS `numrows`
FROM `pemasok`
SELECT COUNT(*) AS `numrows`
FROM `pelanggan`