app/Controllers/ObatController.php

SELECT *
FROM `obat`
---
    public function index()
    {
        $model = new ObatModel();
        $data['obat'] = $model->findAll(); // Mengambil semua data obat

SELECT *
FROM `obat`
WHERE `obat`.`id` = '1'
---
    public function edit($id)
    {
        $model = new ObatModel();
        $data['obat'] = $model->find($id); // Mengambil data obat berdasarkan ID