app/Controllers/PelangganController.php

SELECT *
FROM `pelanggan`
---
    public function index()
    {
        $model = new PelangganModel();
        $data['pelanggan'] = $model->findAll(); // Mengambil semua data pelanggan