app/Controllers/PemasokController.php

    public function index()
    {
        $model = new PemasokModel();
        $data['pemasok'] = $model->findAll();
---
SELECT *
FROM `pemasok`

    public function edit($id)
    {
        $model = new PemasokModel();
        $data['pemasok'] = $model->find($id);
---
SELECT *
FROM `pemasok`
WHERE `pemasok`.`id` = '2'