app/Controllers/PenjualanController.php

    public function index()
    {
        $penjualan = $this->penjualanModel->findAll();

        foreach ($penjualan as &$p) {
            $pelanggan = $this->pelangganModel->find($p['pelanggan_id']);
            $p['nama_pelanggan'] = $pelanggan ? $pelanggan['nama'] : 'Tidak Diketahui';

            // Ambil item penjualan untuk ditampilkan
            $itemPenjualans = $this->itemPenjualanModel->where('penjualan_id', $p['id'])->findAll();
            foreach ($itemPenjualans as &$item) {
                $obat = $this->obatModel->find($item['obat_id']);
---
SELECT *
FROM `penjualan`
SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`id` = '3'
SELECT *
FROM `item_penjualan`
WHERE `penjualan_id` = '1'
SELECT *
FROM `obat`
WHERE `obat`.`id` = '1'

    public function create()
    {
        $data['pelanggan'] = $this->pelangganModel->findAll();
        $data['obat'] = $this->obatModel->findAll();
---
SELECT *
FROM `pelanggan`
SELECT *
FROM `obat`

    public function store()
    {
        $model = new PenjualanModel();
        $obatData = $this->request->getPost('obat');

        $total_harga = 0; // Inisialisasi total harga

        // Menghitung total harga
        foreach ($obatData as $item) {
            $harga = (float)$item['harga'];
            $jumlah = (int)$item['jumlah'];
            $total_harga += $harga * $jumlah; // Hitung total harga
        }

        // Simpan penjualan dengan total harga
        $penjualanData = [
            'pelanggan_id' => $this->request->getPost('pelanggan_id'),
            'tanggal_jual' => date('Y-m-d H:i:s'), // Simpan tanggal penjualan
            'total_harga' => $total_harga // Simpan total harga
        ];

        $model->save($penjualanData); // Simpan data penjualan

        // Simpan item penjualan di tabel item_penjualan
        $itemModel = new ItemPenjualanModel();
        $penjualanID = $model->insertID(); // Ambil ID penjualan terakhir
        foreach ($obatData as $item) {
            $itemModel->save([
                'penjualan_id' => $penjualanID, // ID penjualan yang baru dibuat
                'obat_id' => $item['id'],
                'jumlah' => (int)$item['jumlah'],
                'harga' => (float)$item['harga']
            ]);

            // Update stok obat
            $obatModel = new \App\Models\ObatModel(); // Pastikan model ObatModel sudah dibuat
            $obat = $obatModel->find($item['id']);
            $obatModel->update($item['id'], [
                'stok' => $obat['stok'] - (int)$item['jumlah'] // Kurangi stok sesuai jumlah yang terjual
            ]);
---
INSERT INTO `penjualan` (`pelanggan_id`, `tanggal_jual`, `total_harga`) VALUES ('3', '2024-11-28 14:48:07', 90000)
INSERT INTO `item_penjualan` (`penjualan_id`, `obat_id`, `jumlah`, `harga`) VALUES (4, '6', 3, 30000)
SELECT *
FROM `obat`
WHERE `obat`.`id` = '6'
UPDATE `obat` SET `stok` = 3
WHERE `obat`.`id` IN ('6')

    public function edit($id)
    {
        $model = new PenjualanModel();
        $data['penjualan'] = $model->find($id);

        // Ambil data pelanggan dan obat untuk ditampilkan di dropdown
        $pelangganModel = new PelangganModel();
        $obatModel = new \App\Models\ObatModel();
        $data['pelanggan'] = $pelangganModel->findAll();
        $data['obat'] = $obatModel->findAll();

        // Ambil item penjualan untuk ditampilkan di form edit
        $itemModel = new ItemPenjualanModel();
        $data['item_penjualan'] = $itemModel->where('penjualan_id', $id)->findAll();
---
SELECT *
FROM `penjualan`
WHERE `penjualan`.`id` = '1'
SELECT *
FROM `pelanggan`
SELECT *
FROM `obat`
SELECT *
FROM `item_penjualan`
WHERE `penjualan_id` = '1'

    public function detail($id)
    {
        $penjualan = $this->penjualanModel->find($id);

        // Ambil nama pelanggan
        $pelanggan = $this->pelangganModel->find($penjualan['pelanggan_id']);
        $penjualan['nama_pelanggan'] = $pelanggan ? $pelanggan['nama'] : 'Tidak Diketahui';

        // Ambil item penjualan
        $itemPenjualans = $this->itemPenjualanModel->where('penjualan_id', $id)->findAll();
        foreach ($itemPenjualans as &$item) {
            $obat = $this->obatModel->find($item['obat_id']);
---
SELECT *
FROM `penjualan`
WHERE `penjualan`.`id` = '1'
SELECT *
FROM `pelanggan`
WHERE `pelanggan`.`id` = '3'
SELECT *
FROM `item_penjualan`
WHERE `penjualan_id` = '1'
SELECT *
FROM `obat`
WHERE `obat`.`id` = '1'