app/Controllers/PesananPembelianController.php

SELECT *
FROM `item_pesanan_pembelian`
WHERE `pesanan_pembelian_id` = '1'
SELECT *
FROM `pesanan_pembelian`
SELECT *
FROM `obat`
WHERE `obat`.`id` = '1'
SELECT *
FROM `pemasok`
WHERE `pemasok`.`id` = '2'
---
    public function index()
    {
        $data['pesanan_pembelian'] = $this->pesananPembelianModel->findAll();

        // Mengambil total harga untuk setiap pesanan pembelian
        foreach ($data['pesanan_pembelian'] as &$pesanan) {
            $totalHarga = 0;
            // Ambil detail item pesanan
            $items = $this->itemModel->where('pesanan_pembelian_id', $pesanan['id'])->findAll();

            foreach ($items as $item) {
                $obat = $this->obatModel->find($item['obat_id']);
                $totalHarga += $obat['harga'] * $item['jumlah']; // Hitung total harga
            }

            $pesanan['total_harga'] = $totalHarga; // Simpan total harga dalam array
            // Dapatkan nama pemasok
            $pemasok = $this->pemasokModel->find($pesanan['pemasok_id']);

SELECT *
FROM `pemasok`
SELECT *
FROM `obat`
---
    public function create()
    {
        $data['pemasok'] = $this->pemasokModel->findAll();
        $data['obat'] = $this->obatModel->findAll(); // Mengambil semua obat